In [3]:
import pandas as pd
import numpy as np

In [2]:
# Series

In [3]:
my_dict = {"James" : 50, "Lars" : 60, "Kirk" : 55, "Rob" : 65}

In [4]:
pd.Series(my_dict)

James    50
Lars     60
Kirk     55
Rob      65
dtype: int64

In [5]:
age_list = [50, 60, 55, 65]
name_list = ["James", "Lars", "Kirk", "Rob"]

In [6]:
pd.Series(name_list, age_list)

50    James
60     Lars
55     Kirk
65      Rob
dtype: object

In [7]:
pd.Series(data= age_list, index= name_list)

James    50
Lars     60
Kirk     55
Rob      65
dtype: int64

In [8]:
 numpy_array = np.arange(0, 8)

In [9]:
numpy_array

array([0, 1, 2, 3, 4, 5, 6, 7])

In [10]:
pd.Series(numpy_array)

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
dtype: int32

In [11]:
new_numpy_array = np.array([10, 20, 30, 40])

In [12]:
pd.Series(new_numpy_array)

0    10
1    20
2    30
3    40
dtype: int32

In [13]:
new_numpy_array

array([10, 20, 30, 40])

In [14]:
name_list

['James', 'Lars', 'Kirk', 'Rob']

In [15]:
pd.Series(data= new_numpy_array, index= name_list)

James    10
Lars     20
Kirk     30
Rob      40
dtype: int32

In [16]:
my_series = pd.Series(data= new_numpy_array, index= name_list)

In [17]:
my_series

James    10
Lars     20
Kirk     30
Rob      40
dtype: int32

In [18]:
type(my_series)

pandas.core.series.Series

In [19]:
my_series["Kirk"]

30

In [20]:
my_series["Kirk"] = 60

In [21]:
my_series["Kirk"]

60

In [22]:
quiz_results1 = pd.Series(data= [80, 60, 100], index= ["A", "B", "C"])

In [23]:
quiz_results2 = pd.Series(data= [30, 70, 50], index= ["A", "B", "C"])

In [24]:
quiz_results1

A     80
B     60
C    100
dtype: int64

In [25]:
quiz_results2

A    30
B    70
C    50
dtype: int64

In [26]:
quiz_results1 + quiz_results2

A    110
B    130
C    150
dtype: int64

In [27]:
exam_results1 = pd.Series(data= [80, 60, 100], index= ["A", "B", "C"])

In [28]:
exam_results2 = pd.Series(data= [80, 60, 100], index= ["A", "D", "C"])

In [29]:
exam_results1 + exam_results2

A    160.0
B      NaN
C    200.0
D      NaN
dtype: float64

In [1]:
# DataFrames

In [4]:
my_data = np.array([[10,20,30], [20,30,40], [20,50,10], [10,15,20]])

In [5]:
my_data

array([[10, 20, 30],
       [20, 30, 40],
       [20, 50, 10],
       [10, 15, 20]])

In [6]:
my_names = ["Ross", "Chandler", "Joey", "Monica"]

In [7]:
my_columns = ["Jan", "Feb", "Mar"]

In [9]:
my_data_frame = pd.DataFrame(my_data)

In [10]:
my_data_frame

    0   1   2
0  10  20  30
1  20  30  40
2  20  50  10
3  10  15  20

In [11]:
my_data_frame[1]

0    20
1    30
2    50
3    15
Name: 1, dtype: int32

In [14]:
new_data_frame = pd.DataFrame(my_data, index= my_names, columns= my_columns)

In [15]:
new_data_frame

          Jan  Feb  Mar
Ross       10   20   30
Chandler   20   30   40
Joey       20   50   10
Monica     10   15   20

In [16]:
new_data_frame["Feb"]

Ross        20
Chandler    30
Joey        50
Monica      15
Name: Feb, dtype: int32

In [17]:
type(new_data_frame["Feb"])

pandas.core.series.Series

In [18]:
feb_series = new_data_frame["Feb"]

In [20]:
feb_series.mean()

28.75

In [21]:
feb_series.Ross

20

In [22]:
feb_series.max()

50

In [25]:
new_data_frame["Jan"].mean()

15.0

In [28]:
new_data_frame[["Jan", "Feb"]]

          Jan  Feb
Ross       10   20
Chandler   20   30
Joey       20   50
Monica     10   15

In [29]:
new_data_frame.loc["Monica"]

Jan    10
Feb    15
Mar    20
Name: Monica, dtype: int32

In [30]:
new_data_frame.iloc[3]

Jan    10
Feb    15
Mar    20
Name: Monica, dtype: int32

In [32]:
new_data_frame["Apr"] = new_data_frame["Mar"] * 2

In [33]:
new_data_frame

          Jan  Feb  Mar  Apr
Ross       10   20   30   60
Chandler   20   30   40   80
Joey       20   50   10   20
Monica     10   15   20   40

In [37]:
new_data_frame.drop("Joey", axis=0) # Axis=0 : Rows, Axis=1 : Columns

          Jan  Feb  Mar  Apr
Ross       10   20   30   60
Chandler   20   30   40   80
Monica     10   15   20   40

In [38]:
new_data_frame.drop("Apr", axis=1)

          Jan  Feb  Mar
Ross       10   20   30
Chandler   20   30   40
Joey       20   50   10
Monica     10   15   20

In [39]:
new_data_frame

          Jan  Feb  Mar  Apr
Ross       10   20   30   60
Chandler   20   30   40   80
Joey       20   50   10   20
Monica     10   15   20   40

In [40]:
new_data_frame.drop("Apr", axis=1, inplace=True)

In [41]:
new_data_frame["Jan"]["Monica"]

10

In [43]:
boolean_frame = new_data_frame > 25

In [44]:
boolean_frame

            Jan    Feb    Mar
Ross      False  False   True
Chandler  False   True   True
Joey      False   True  False
Monica    False  False  False

In [45]:
new_data_frame[boolean_frame]

          Jan   Feb   Mar
Ross      NaN   NaN  30.0
Chandler  NaN  30.0  40.0
Joey      NaN  50.0   NaN
Monica    NaN   NaN   NaN

In [46]:
new_data_frame[new_data_frame > 30]

          Jan   Feb   Mar
Ross      NaN   NaN   NaN
Chandler  NaN   NaN  40.0
Joey      NaN  50.0   NaN
Monica    NaN   NaN   NaN

In [47]:
new_data_frame[new_data_frame["Mar"] > 25]

          Jan  Feb  Mar
Ross       10   20   30
Chandler   20   30   40

In [48]:
new_data_frame.reset_index()

      index  Jan  Feb  Mar
0      Ross   10   20   30
1  Chandler   20   30   40
2      Joey   20   50   10
3    Monica   10   15   20

In [50]:
new_data_frame["NewIndex"] = ["First", "Second", "Third", "Fourth"]

In [52]:
new_data_frame.set_index("NewIndex")

          Jan  Feb  Mar
NewIndex
First      10   20   30
Second     20   30   40
Third      20   50   10
Fourth     10   15   20

In [53]:
new_data_frame

          Jan  Feb  Mar NewIndex
Ross       10   20   30    First
Chandler   20   30   40   Second
Joey       20   50   10    Third
Monica     10   15   20   Fourth

In [1]:
# Pandas DataFrame Operations

In [4]:
my_dictionary = {"Ross": [40,30,np.nan], "Chandler": [20,np.nan,50], "Lars": [30,50,40]}

In [5]:
my_data_frame = pd.DataFrame(my_dictionary)

In [6]:
my_data_frame

   Ross  Chandler  Lars
0  40.0      20.0    30
1  30.0       NaN    50
2   NaN      50.0    40

In [8]:
my_data_frame.dropna() # Remove ones which includes nan.

   Ross  Chandler  Lars
0  40.0      20.0    30

In [9]:
my_data_frame

   Ross  Chandler  Lars
0  40.0      20.0    30
1  30.0       NaN    50
2   NaN      50.0    40

In [10]:
my_data_frame.dropna(axis= 1)

   Lars
0    30
1    50
2    40

In [11]:
my_new_dictionary = {"Ross": [40,30,np.nan], "Chandler": [20,np.nan,50], "Lars": [30,50,40], "Joey": [45,np.nan,np.nan]}

In [12]:
my_new_data_frame = pd.DataFrame(my_new_dictionary)

In [13]:
my_new_data_frame

   Ross  Chandler  Lars  Joey
0  40.0      20.0    30  45.0
1  30.0       NaN    50   NaN
2   NaN      50.0    40   NaN

In [15]:
my_new_data_frame.dropna(axis= 1, thresh= 2) # There should be at least 2 index otherwise remove it.

   Ross  Chandler  Lars
0  40.0      20.0    30
1  30.0       NaN    50
2   NaN      50.0    40

In [17]:
my_new_data_frame.fillna(20) # Fill the all empty indexes with 20.

   Ross  Chandler  Lars  Joey
0  40.0      20.0    30  45.0
1  30.0      20.0    50  20.0
2  20.0      50.0    40  20.0

In [21]:
salary_dict = {"Programming Language": ["Python","Python","Python","Java","Java","Swift"], "Name": ["A","B","C","D","E","F"], "Salary": [100,90,80,70,60,50]}

In [22]:
salary_frame = pd.DataFrame(salary_dict)

In [23]:
salary_frame

  Programming Language Name  Salary
0               Python    A     100
1               Python    B      90
2               Python    C      80
3                 Java    D      70
4                 Java    E      60
5                Swift    F      50

In [27]:
group_object = salary_frame.groupby("Programming Language")

In [28]:
group_object.count()

                      Name  Salary
Programming Language
Java                     2       2
Python                   3       3
Swift                    1       1

In [31]:
# group_object.mean()

In [32]:
group_object.min()

                     Name  Salary
Programming Language
Java                    D      60
Python                  A      80
Swift                   F      50

In [34]:
group_object.max()

                     Name  Salary
Programming Language
Java                    E      70
Python                  C     100
Swift                   F      50

In [35]:
group_object.min("Salary")

                      Salary
Programming Language
Java                      60
Python                    80
Swift                     50

In [36]:
group_object.describe()

                     Salary
                      count  mean        std   min   25%   50%   75%    max
Programming Language
Java                    2.0  65.0   7.071068  60.0  62.5  65.0  67.5   70.0
Python                  3.0  90.0  10.000000  80.0  85.0  90.0  95.0  100.0
Swift                   1.0  50.0        NaN  50.0  50.0  50.0  50.0   50.0

In [37]:
my_dict1 = {"Name:": ["A","B","C","D"],
            "Sports": ["Basketball","Football","Tennis","Running"],
            "Calories": [100,200,300,400]
            }

In [50]:
my_frame1 = pd.DataFrame(my_dict1, index=[1,2,3,4])

In [51]:
my_frame1

  Name:      Sports  Calories
1     E  Basketball       200
2     F    Football        50
3     G      Tennis       330
4     H     Running       440

In [52]:
my_dict2 = {"Name:": ["E","F","G","H"],
            "Sports": ["Basketball","Football","Tennis","Running"],
            "Calories": [200,50,330,440]
            }

In [53]:
my_frame2 = pd.DataFrame(my_dict2, index=[5,6,7,8])

In [54]:
my_dict3 = {"Name:": ["I","J","K","L"],
            "Sports": ["Basketball","Football","Tennis","Running"],
            "Calories": [300,150,320,410]
            }

In [56]:
my_frame3 = pd.DataFrame(my_dict3, index=[9,10,11,12])

In [57]:
# Concatenation.

In [58]:
pd.concat([my_frame1, my_frame2, my_frame3])

   Name:      Sports  Calories
1      E  Basketball       200
2      F    Football        50
3      G      Tennis       330
4      H     Running       440
5      E  Basketball       200
6      F    Football        50
7      G      Tennis       330
8      H     Running       440
9      I  Basketball       300
10     J    Football       150
11     K      Tennis       320
12     L     Running       410

In [59]:
# Merge.

In [60]:
my_frame1

  Name:      Sports  Calories
1     E  Basketball       200
2     F    Football        50
3     G      Tennis       330
4     H     Running       440

In [61]:
my_frame2

  Name:      Sports  Calories
5     E  Basketball       200
6     F    Football        50
7     G      Tennis       330
8     H     Running       440

In [62]:
pd.merge(my_frame1, my_frame2, on="Sports")

  Name:_x      Sports  Calories_x Name:_y  Calories_y
0       E  Basketball         200       E         200
1       F    Football          50       F          50
2       G      Tennis         330       G         330
3       H     Running         440       H         440

In [64]:
new_salary_frame = pd.DataFrame({"Name": ["Ross", "Joey", "Rachel"], "Salary": [10,20,30], "Age": [60,65,70]})

In [65]:
new_salary_frame

     Name  Salary  Age
0    Ross      10   60
1    Joey      20   65
2  Rachel      30   70

In [66]:
new_salary_frame["Name"].unique()

array(['Ross', 'Joey', 'Rachel'], dtype=object)

In [67]:
new_salary_frame["Name"].nunique()

3

In [68]:
def grossToNet(salary):
    return salary * 0.65

In [69]:
new_salary_frame["Salary"].apply(grossToNet)

0     6.5
1    13.0
2    19.5
Name: Salary, dtype: float64